docs/load-test/results/s5on-r1-k6-stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: s2-inventory-sustained.js
        output: -

     scenarios: (100.00%) 2 scenarios, 500 max VUs, 1m22s max duration (incl. graceful stop):
              * warmup: 50.00 iterations/s for 30s (maxVUs: 50-100, exec: warmup, gracefulStop: 30s)
              * sustained: 300.00 iterations/s for 20s (maxVUs: 200-400, startTime: 32s, gracefulStop: 30s)

time="2026-08-16T21:38:20+09:00" level=info msg="[S2/S5] roomType=1 date=2026-09-12 stock=100 load=300/s x 20s" source=console

running (0m01.0s), 000/250 VUs, 48 complete and 0 interrupted iterations
warmup      [   3% ] 000/050 VUs  01.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      31.0s     

running (0m02.0s), 000/250 VUs, 98 complete and 0 interrupted iterations
warmup      [   7% ] 000/050 VUs  02.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      30.0s     

running (0m03.0s), 000/250 VUs, 148 complete and 0 interrupted iterations
warmup      [  10% ] 000/050 VUs  03.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      29.0s     

running (0m04.0s), 000/250 VUs, 198 complete and 0 interrupted iterations
warmup      [  13% ] 000/050 VUs  04.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      28.0s     

running (0m05.0s), 000/250 VUs, 248 complete and 0 interrupted iterations
warmup      [  17% ] 000/050 VUs  05.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      27.0s     

running (0m06.0s), 000/250 VUs, 298 complete and 0 interrupted iterations
warmup      [  20% ] 000/050 VUs  06.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      26.0s     

running (0m07.0s), 000/250 VUs, 348 complete and 0 interrupted iterations
warmup      [  23% ] 000/050 VUs  07.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      25.0s     

running (0m08.0s), 000/250 VUs, 398 complete and 0 interrupted iterations
warmup      [  27% ] 000/050 VUs  08.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      24.0s     

running (0m09.0s), 000/250 VUs, 448 complete and 0 interrupted iterations
warmup      [  30% ] 000/050 VUs  09.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      23.0s     

running (0m10.0s), 000/250 VUs, 498 complete and 0 interrupted iterations
warmup      [  33% ] 000/050 VUs  10.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      22.0s     

running (0m11.0s), 000/250 VUs, 548 complete and 0 interrupted iterations
warmup      [  37% ] 000/050 VUs  11.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      21.0s     

running (0m12.0s), 000/250 VUs, 598 complete and 0 interrupted iterations
warmup      [  40% ] 000/050 VUs  12.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      20.0s     

running (0m13.0s), 000/250 VUs, 648 complete and 0 interrupted iterations
warmup      [  43% ] 000/050 VUs  13.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      19.0s     

running (0m14.0s), 000/250 VUs, 698 complete and 0 interrupted iterations
warmup      [  47% ] 000/050 VUs  14.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      18.0s     

running (0m15.0s), 000/250 VUs, 748 complete and 0 interrupted iterations
warmup      [  50% ] 000/050 VUs  15.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      17.0s     

running (0m16.0s), 000/250 VUs, 798 complete and 0 interrupted iterations
warmup      [  53% ] 000/050 VUs  16.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      16.0s     

running (0m17.0s), 000/250 VUs, 848 complete and 0 interrupted iterations
warmup      [  57% ] 000/050 VUs  17.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      15.0s     

running (0m18.0s), 001/250 VUs, 897 complete and 0 interrupted iterations
warmup      [  60% ] 001/050 VUs  18.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      14.0s     

running (0m19.0s), 000/250 VUs, 948 complete and 0 interrupted iterations
warmup      [  63% ] 000/050 VUs  19.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      13.0s     

running (0m20.0s), 000/250 VUs, 998 complete and 0 interrupted iterations
warmup      [  67% ] 000/050 VUs  20.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      12.0s     

running (0m21.0s), 000/250 VUs, 1048 complete and 0 interrupted iterations
warmup      [  70% ] 000/050 VUs  21.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      11.0s     

running (0m22.0s), 000/250 VUs, 1098 complete and 0 interrupted iterations
warmup      [  73% ] 000/050 VUs  22.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      10.0s     

running (0m23.0s), 000/250 VUs, 1148 complete and 0 interrupted iterations
warmup      [  77% ] 000/050 VUs  23.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      09.0s     

running (0m24.0s), 000/250 VUs, 1198 complete and 0 interrupted iterations
warmup      [  80% ] 000/050 VUs  24.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      08.0s     

running (0m25.0s), 000/250 VUs, 1248 complete and 0 interrupted iterations
warmup      [  83% ] 000/050 VUs  25.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      07.0s     

running (0m26.0s), 000/250 VUs, 1298 complete and 0 interrupted iterations
warmup      [  87% ] 000/050 VUs  26.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      06.0s     

running (0m27.0s), 000/250 VUs, 1348 complete and 0 interrupted iterations
warmup      [  90% ] 000/050 VUs  27.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      05.0s     

running (0m28.0s), 000/250 VUs, 1398 complete and 0 interrupted iterations
warmup      [  93% ] 000/050 VUs  28.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      04.0s     

running (0m29.0s), 000/250 VUs, 1448 complete and 0 interrupted iterations
warmup      [  97% ] 000/050 VUs  29.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      03.0s     

running (0m30.0s), 000/250 VUs, 1498 complete and 0 interrupted iterations
warmup      [ 100% ] 000/050 VUs  30.0s/30s  50.00 iters/s
sustained • [   0% ] waiting      02.0s     

running (0m31.0s), 000/250 VUs, 1501 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s  50.00 iters/s
sustained • [   0% ] waiting      01.0s

running (0m32.0s), 000/250 VUs, 1501 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s  50.00 iters/s
sustained • [   0% ] waiting      00.0s

running (0m33.0s), 016/250 VUs, 1772 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [   5% ] 016/200 VUs  01.0s/20s  300.00 iters/s

running (0m34.0s), 007/250 VUs, 2081 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  10% ] 007/200 VUs  02.0s/20s  300.00 iters/s

running (0m35.0s), 013/250 VUs, 2375 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  15% ] 013/200 VUs  03.0s/20s  300.00 iters/s

running (0m36.0s), 012/250 VUs, 2676 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  20% ] 012/200 VUs  04.0s/20s  300.00 iters/s

running (0m37.0s), 015/250 VUs, 2973 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  25% ] 015/200 VUs  05.0s/20s  300.00 iters/s

running (0m38.0s), 022/250 VUs, 3266 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  30% ] 022/200 VUs  06.0s/20s  300.00 iters/s

running (0m39.0s), 009/250 VUs, 3579 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  35% ] 009/200 VUs  07.0s/20s  300.00 iters/s

running (0m40.0s), 013/250 VUs, 3875 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  40% ] 013/200 VUs  08.0s/20s  300.00 iters/s

running (0m41.0s), 012/250 VUs, 4176 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  45% ] 012/200 VUs  09.0s/20s  300.00 iters/s

running (0m42.0s), 010/250 VUs, 4478 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  50% ] 010/200 VUs  10.0s/20s  300.00 iters/s

running (0m43.0s), 013/250 VUs, 4775 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  55% ] 013/200 VUs  11.0s/20s  300.00 iters/s

running (0m44.0s), 008/250 VUs, 5080 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  60% ] 008/200 VUs  12.0s/20s  300.00 iters/s

running (0m45.0s), 010/250 VUs, 5378 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  65% ] 010/200 VUs  13.0s/20s  300.00 iters/s

running (0m46.0s), 015/250 VUs, 5673 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  70% ] 015/200 VUs  14.0s/20s  300.00 iters/s

running (0m47.0s), 027/250 VUs, 5961 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  75% ] 027/200 VUs  15.0s/20s  300.00 iters/s

running (0m48.0s), 012/250 VUs, 6276 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  80% ] 012/200 VUs  16.0s/20s  300.00 iters/s

running (0m49.0s), 012/250 VUs, 6576 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  85% ] 012/200 VUs  17.0s/20s  300.00 iters/s

running (0m50.0s), 008/250 VUs, 6880 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  90% ] 008/200 VUs  18.0s/20s  300.00 iters/s

running (0m51.0s), 015/250 VUs, 7173 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [  95% ] 015/200 VUs  19.0s/20s  300.00 iters/s

running (0m52.0s), 011/250 VUs, 7477 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s        50.00 iters/s
sustained   [ 100% ] 011/200 VUs  20.0s/20s  300.00 iters/s
time="2026-08-16T21:39:12+09:00" level=info msg="[S2/S5] 날짜 2026-09-12, 초기 재고 100." source=console
time="2026-08-16T21:39:12+09:00" level=info msg="[S2/S5] verify/s2.sql 로 확인: 활성 예약 = 재고, 잔여 = 0, remaining<0 0건" source=console
time="2026-08-16T21:39:12+09:00" level=info msg="[S5 대조] 락 OFF에서도 성공이 정확히 재고 수여야 한다. 2차 방어선(조건부 UPDATE)의 증명이다." source=console
time="2026-08-16T21:39:12+09:00" level=info msg="[S5 대조] 초과 판매가 나오면 F04의 실패가 아니라 발견이다. 즉시 보고할 것." source=console

     ✓ 5xx 아님
     ✓ 400 아님
     ✓ 성공이거나 정중한 거절

   ✓ bad_request....................: 0       0/s
     checks.........................: 100.00% 18003 out of 18003
     data_received..................: 1.9 MB  36 kB/s
     data_sent......................: 2.0 MB  38 kB/s
     dur_created....................: avg=71.01ms  min=5.02ms   med=56.17ms  max=219.51ms p(90)=167.67ms p(95)=195.6ms  p(99)=204.99ms
     dur_lock_failed................: avg=199.61ms min=191.35ms med=198.11ms max=245.03ms p(90)=205.68ms p(95)=213.97ms p(99)=229.65ms
     dur_rej_inventory..............: avg=40ms     min=2.53ms   med=26.18ms  max=216.57ms p(90)=106.32ms p(95)=138.68ms p(99)=185.57ms
   ✓ forbidden_transition_passed....: 0       0/s
     http_req_blocked...............: avg=17.05µs  min=0s       med=2µs      max=2.57ms   p(90)=12µs     p(95)=18µs     p(99)=380.96µs
     http_req_connecting............: avg=11.67µs  min=0s       med=0s       max=2.53ms   p(90)=0s       p(95)=0s       p(99)=334.98µs
     http_req_duration..............: avg=37.76ms  min=540µs    med=16.27ms  max=245.03ms p(90)=113.48ms p(95)=167.42ms p(99)=201.48ms
       { expected_response:true }...: avg=6.66ms   min=540µs    med=2.34ms   max=219.51ms p(90)=4.62ms   p(95)=16.15ms  p(99)=133.88ms
     ✓ { phase:main }...............: avg=46.61ms  min=2.53ms   med=26.5ms   max=245.03ms p(90)=129.52ms p(95)=183.66ms p(99)=202.35ms
     http_req_failed................: 78.65%  5901 out of 7502
     http_req_receiving.............: avg=30.59µs  min=8µs      med=15µs     max=3.21ms   p(90)=81µs     p(95)=105µs    p(99)=153µs   
     http_req_sending...............: avg=13.88µs  min=2µs      med=7µs      max=1.95ms   p(90)=33µs     p(95)=44.94µs  p(99)=70µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=37.71ms  min=517µs    med=16.25ms  max=245.01ms p(90)=113.46ms p(95)=167.39ms p(99)=201.45ms
     http_reqs......................: 7502    144.105159/s
     ✓ { phase:main }...............: 6001    115.272602/s
     iteration_duration.............: avg=37.91ms  min=585µs    med=16.39ms  max=245.15ms p(90)=113.6ms  p(95)=167.68ms p(99)=201.76ms
     iterations.....................: 7502    144.105159/s
     lock_failed....................: 229     4.398838/s
   ✓ not_found......................: 0       0/s
     rej_inventory..................: 5672    108.952874/s
   ✓ rsv_created....................: 100     1.92089/s
   ✓ server_error...................: 0       0/s
   ✓ unknown_rejection..............: 0       0/s
     vus............................: 11      min=0              max=27 
     vus_max........................: 250     min=250            max=250


running (0m52.1s), 000/250 VUs, 7502 complete and 0 interrupted iterations
warmup    ✓ [ 100% ] 000/050 VUs  30s  50.00 iters/s
sustained ✓ [ 100% ] 000/200 VUs  20s  300.00 iters/s